{"intents":[
  { "tag": "saudacao",
    "patterns":["Ola","Opa","Oi", "tudo bem"],
    "responses": ["Oi, como posso ajudar?"]
  },
  { "tag": "despedida",
    "patterns":["valeu","tchau","Obrigado","tks"],
    "responses": ["Até mais!"]
  },
  { "tag": "pre_requisitos",
    "patterns":["Quais são os pre requisitos do intercambio?", "Prerequisitos", "Pre requisitos"],
    "responses": ["O candidato a ser selecionado e indicado pelo Centro Universitário FEI à instituição anfitriã deverá preencher, obrigatoriamente, os seguintes requisitos:\n-Estar regularmente matriculado no Centro Universitário FEI;\n-Estar em dia com as obrigações assumidas no Contrato de Prestação de Serviços Educacionais assinado com a FEI;\n-Ter integralizado no mínimo 30% do currículo previsto para seu curso, no momento do início previsto da viagem de estudos;\n-Ter média aritmética de todas as disciplinas cursadas igual ou maior a 6,0 (seis);\n-Manifestar compromisso de retornar ao Brasil após o período de estudos no exterior para conclusão dos estudos de graduação no Centro Universitário FEI;\n-Possuir proficiência no idioma do curso de destino (Obs.: Instituições de ensino superior podem exigir pontuação mínima em exame de proficiência na língua estrangeira."]
  },
  { "tag": "candidatura",
    "patterns":["Como me candidatar ao intercâmbio?", "Como realizar intercâmbio?", "Como o intercâmbio funciona?", "Como fazer intercâmbio?", "Quais documentos eu preciso?", "Documentação necessária", "Quais documentos"],
    "responses": ["Antes de iniciar a candidatura, o interessado deverá certificar-se que a instituição de destino oferece cursos na sua área de estudos e confirmar a disponibilidade de vagas.\nUma vez selecionada a instituição para a qual irá se postular, o estudante deverá apresentar todos documentos de candidatura listados abaixo à Coordenadoria de Relações Internacionais do Centro Universitário FEI, localizada no Prédio D - térreo - sala 07:\n-Formulário de Inscrição FEI;\n-Ficha de Inscrição da Instituição de destino;\n-Cópia da página de identificação do passaporte, com validade para todo o período de estudos no exterior;\n-Histórico escolar (em português ou inglês, dependendo do destino);\n-Carta de Apresentação/Motivação (no idioma da universidade anfitriã);\n-Currículo (no idioma da universidade anfitriã).\n-2 fotos 3x4;\n-Caso necessário, o candidato deverá se responsabilizar por eventual tradução de documentos.\n\nAs instituições de destino podem solicitar documentos adicionais, não listados acima."]
  },
  { "tag": "duracao",
    "patterns":["quanto dura um intercambio?", "periodo do intercambio", "duracao do intercambio"],
    "responses": ["O intercâmbio dura por 1 (um) semestre, e o intercâmbio semestral poderá ser renovado pelo mesmo período desde que a FEI e a instituição acolhedora concordem com a extensão do programa e a permanência do aluno."]
  },
  { "tag": "data_limite",
    "patterns":["Até quando posso entregar a documentação?", "Data limite", "Data limite para entregar documentos"],
    "responses": ["1º semestre: 15 de setembro\n2º semestre: 1 de abril\nNão será aceita documentação incompleta ou fora do prazo."]
  },
  { "tag": "selecao",
    "patterns":["como funciona o processo de selecao?", "processo de selecao", "processo de seleção", "como ser escolhido", "como posso ser escolhido?"],
    "responses": ["O programa de intercâmbio funciona baseado no princípio da reciprocidade, e o número de vagas disponíveis na instituição anfitriã pode variar dependendo do número de alunos estrangeiros recebidos.\nAs instituições no exterior podem limitar a quantidade de vagas oferecidas.\nCaso existam mais candidatos que o número de vagas disponíveis, o Centro Universitário FEI selecionará o aluno que será nomeado à instituição estrangeira com base nos seguintes critérios:\n\n-Ciclo no qual o estudante está matriculado (serão considerados os alunos dos ciclos mais avançados);\n-Melhores médias obtidas ao longo dos ciclos anteriores (média aritmética);\n-Proficiência no idioma do curso de destino (em alguns casos este critério pode ser determinante);\n-Qualidade dos documentos apresentados;\n-Cumprimento de prazos e correto preenchimento dos formulários;\n-Parecer acadêmico do Coordenador de Curso.\n\nOs critérios acima não seguem uma ordem."]
  },
  { "tag": "custos",
  "patterns":["quanto custa o intercâmbio?", "custos do intercambio", "custos", "qual o preço do intercambio", "preço do intercambio", "valor do intercambio", "valor a ser pago", "pagamento"],
  "responses": ["Durante o período de intercâmbio, o estudante continuará regularmente matriculado no Centro Universitário, com registro acadêmico 'em intercâmbio', e deverá continuar pagando as mesmas taxas de matrícula e mensalidades à FEI, sem qualquer acréscimo. Com exceção de possíveis taxas administrativas do país ou universidade anfitriã, o participante do programa estará isento de pagamentos à instituição estrangeira.\nOs custos de hospedagem, alimentação, seguro de saúde, passaporte, visto, passagem aérea e gastos pessoais são de responsabilidade do aluno."]
  },
  { "tag": "dupla_diplomacao",
  "patterns":["dupla diplomação", "é possível dupla diplomação?"],
  "responses": ["O Centro Universitário FEI mantém acordos internacionais para programas de dupla-diplomação, possibilitando que os participantes obtenham dois diplomas ao término do curso de graduação."]
  },
  { "tag": "bolsa_de_estudos",
  "patterns":["bolsas de estudo que a FEI oferece","bolsa de estudos", "bolsa", "apoio financeiro", "desconto"],
  "responses": ["A FEI oferece através de parceiros vários programas de bolsas para alunos. Abaixo está uma lista:\n-Santander Superamos Juntos\n-TOP España\n-Bolsas Ibero-Americanas\n-Fórmula Santander\n-Santander Mundi\nCAPES / BRAFITEC"]
  },
  { "tag": "contato",
  "patterns":["como entrar em contato", "qual é o contato", "informações de contato", "contato"],
  "responses": ["Entre com o contato com a Coordenadoria das Relações Internacionais através de:\n-Email: internacional@fei.edu.br\n-Telefone: +55 11 4353- 2900 Ramal: 2234\n-Local: Campus São Bernardo do Campo - Prédio D - Térreo - Sala 07"]
  },
  { "tag": "idiomas",
    "patterns":["Quais os idiomas do intercambio?","Quais idiomas?", "idiomas", "idioma"],
    "responses": ["Há intercâmbios para os seguintes idiomas: Inglês, espanhol, alemão, francês, italiano, mandarin, húngaro, suéco"]
  },
  { "tag": "cursos_idioma",
    "patterns":["Quais cursos de idioma a FEI recomenda?", "Cursos de idioma"],
    "responses": ["A FEI possúi parceiros para os seguintes idiomas: Alemão, Catalão, Mandarin, Francês, Espanhol, Inglês.\nEm qual idioma você têm interesse?"]
  },
  { "tag": "idioma_alemao",
    "patterns":["Cursos de alemao"],
    "responses": ["Confira https://www.stk.kit.edu/daf-stub.php"]
  },
  { "tag": "idioma_catalao",
    "patterns":["Cursos de catalao"],
    "responses": ["Confira http://www.uab.cat/web/cursos-de-idiomas/lenguas-1215413661530.html?param1=1195026073065"]
  },
  { "tag": "idioma_mandarin",
    "patterns":["Cursos de mandarim"],
    "responses": ["Confira http://www.clec.pu.edu.tw/tuition.aspx"]
  },
  { "tag": "idioma_frances",
    "patterns":["Cursos de frances"],
    "responses": ["Confira https://www.aliancafrancesagabc.com.br/"]
  },
  { "tag": "idioma_espanhol",
    "patterns":["Cursos de espanhol"],
    "responses": ["Confira http://www.uahurtado.cl/red-internacional-2/estudiantes-extranjeros/programa-intensivo-de-lenguaje-cultura-e-inmersion-social/"]
  },
  { "tag": "idioma_ingles",
    "patterns":["Cursos de ingles"],
    "responses": ["Confira https://www.cpp.edu/~cpeli/study-english/english-language-program.shtml"]
  }
]
}
